<details>
<summary>Here is the plan for directory /home/igor/projects/go/src/github.com/igorbrites/neptune:</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
! destroy and then create replacement

Terraform will perform the following actions:

@@ # aws_s3_bucket.b must be replaced @@
! resource "aws_s3_bucket" "b" {
+   acceleration_status         = (known after apply)
    acl                         = "private"
-   arn                         = "arn:aws:s3:::my-neptune-test-bucket"
+   arn                         = (known after apply)
-   bucket                      = "my-neptune-test-bucket"
+   bucket                      = "my-neptune-test- bucket" # forces replacement
-   bucket_domain_name          = "my-neptune-test-bucket.s3.amazonaws.com"
+   bucket_domain_name          = (known after apply)
-   bucket_regional_domain_name = "my-neptune-test-bucket.s3.amazonaws.com"
+   bucket_regional_domain_name = (known after apply)
    force_destroy               = false
-   hosted_zone_id              = "Z3AQBSTGFYJSTF"
+   hosted_zone_id              = (known after apply)
-   id                          = "my-neptune-test-bucket"
+   id                          = (known after apply)
-   region                      = "us-east-1"
+   region                      = (known after apply)
-   request_payer               = "BucketOwner"
+   request_payer               = (known after apply)
!   tags                        = {
-       "Environment" = "Dev"
+       "Environment" = "Personal"
-       "Name"        = "My bucket"
+       "Name"        = "My new bucket"
    }
+   website_domain              = (known after apply)
+   website_endpoint            = (known after apply)

!   versioning {
-       enabled    = false
+       enabled    = (known after apply)
-       mfa_delete = false
+       mfa_delete = (known after apply)
    }
}

@@ # aws_s3_bucket.c will be created @@
+ resource "aws_s3_bucket" "c" {
+   acceleration_status         = (known after apply)
+   acl                         = "private"
+   arn                         = (known after apply)
+   bucket                      = "other-neptune-test-bucket"
+   bucket_domain_name          = (known after apply)
+   bucket_regional_domain_name = (known after apply)
+   force_destroy               = false
+   hosted_zone_id              = (known after apply)
+   id                          = (known after apply)
+   region                      = (known after apply)
+   request_payer               = (known after apply)
+   tags                        = {
+       "Environment" = "Personal"
+       "Name"        = "My new bucket"
    }
+   website_domain              = (known after apply)
+   website_endpoint            = (known after apply)

+   versioning {
+       enabled    = (known after apply)
+       mfa_delete = (known after apply)
    }
}

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>
